# Напишите и запустите программу. которая выводит строку  "Hello world!"
print("Hello world!")

# Напишите программу, которая на входе
# получает имя пользователя, cохраняет его в переменную user_name и выводит строку  "Hello {user_name}!"
user_name = input('Please, enter user name: ')
print(f"Hello, {user_name}!")

# Напишите программу, которая на входе получает 2 числа,
# производит с ними арифметическую операцию(на ваше усмотрение), и выводит “Результат = {результат}”.
num = int(input('number 1 '))
num1 = int(input('number 2 '))
print(f"результат = {num * num1}")

# Напишите
# программу, чтобы
# вывести:
#
# ** ** ** ** *
# *           *
# *           *
# ** ** ** ** *
print("*********")
print("*       *")
print("*       *")
print("*********")

